smooks-cartridges/routing/src/test/java/org/smooks/routing/basic/input-message-01.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <soapenv:Header>
    </soapenv:Header>
    <soapenv:Body>
        <cc1:Address xmlns:cc1="http://test.com">
            <cc1:AddressType>Home</cc1:AddressType>
            <cc1:AddressLine1>String</cc1:AddressLine1>
            <cc1:City>String</cc1:City>
            <cc1:PostalCode>String</cc1:PostalCode>
            <cc1:County>String</cc1:County>
        </cc1:Address>
    </soapenv:Body>
</soapenv:Envelope>